#+title: Actuator Emacs
#+startup: contents
#+property: header-args :tangle (expand-file-name "init.el" user-emacs-directory) :comments link

*** Attachment reminder
:PROPERTIES:
:CREATED:  [2022-05-27 Fri 15:14]
:END:
:LOGBOOK:
- Refiled on [2022-06-13 Mon 17:32]
- State "NEXT"       from "TODO"       [2022-06-13 Mon 17:02]
- State "NEXT"       from "TODO"       [2022-06-13 Mon 16:39]
- Refiled on [2022-06-08 Wed 21:08]
:END:
#+begin_src emacs-lisp
  ;; thunderbird attachment reminder
  ;; "attach\\|\Wfiles?\W\\|\Wphoto\\|\Where\s-+is\\|\Where\s-+are\\|\Where\s-+it\s-+is\\|enclose\\|\Wdraft\\|\Wversion"

  (defvar xtr-message-attachment-regexp "\\([Ww]e send\\|[Ii]
  send\\|attach\\)")

  (defun xtr-message-check-attachment ()
    "Check if there is an attachment in the message if I claim it."
    (eval-when-compile
      (declare-function message-goto-body "message" (&optional interactive))
      (declare-function message-y-or-n-p "message" t t))
    (save-excursion
      (message-goto-body)
      (when (search-forward-regexp xtr-message-attachment-regexp nil t nil)
        (message-goto-body)
        (unless (or (search-forward "<#part" nil t nil)
                    (message-y-or-n-p
                     "No attachment. Send the message ?" nil nil))
          (error "No message sent")))))

  (add-hook 'message-send-hook 'xtr-message-check-attachment)
#+end_src

#+results:
| xtr-message-check-attachment |

